#+TITLE: Universal Turing Machines and Computer Programs
#+OPTIONS: H:4 num:nil toc:t \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t ':t |:t
#+STARTUP: showeverything entitiespretty inlineimages

  Let\rsquo{}s see what the *Big Picture So Far* is:

* The Rule 110
  The “Rule 110 Cellular Automaton” is a famous example of universal
  computation resulting from extremely simple rules:
#+name: rule-110
#+BEGIN_SRC python :results silent :tangle rule110.py
  # Conceptually, we think of the cells of the automaton being filled
  # with zeros and ones, but we will encode these as '-' and 'G'
  # respectively, since those characters happen to give a more appealing
  # visual appearance when successive results are printed out.
  zero = '-'
  one = 'G'

  # updateRule is a dictionary mapping a triple of cells to the new
  # value of the middle cell of that triple in the next timestep.
  updateRule = {
      (zero, zero, zero): zero,
      (zero, zero, one): one,
      (zero, one, zero): one,
      (zero, one, one): one,
      (one, zero, zero): zero,
      (one, zero, one): one,
      (one, one, zero): one,
      (one, one, one): zero,
      }

  def rule110(tape):
      """Implements a single timestep of the Rule 110 automaton.

      Args:

          tape (str): A string representing the current tape of zeros
              and ones.

      Returns:

          str: The updated contents of the tape after a single
              timestep. The left and right ends of the tape are assumed
              to be padded with zeros.

      """
    
      L = len(tape)
      updatedTape = []
      for i in range(L):
          # The left and right ends of the tape need to be treated
          # separately since they should be padded with a zero.
          if i==0:
              # pad with a zero on the left
              (left, middle, right) = (zero, tape[i], tape[i+1])
          elif i==L-1:
              # pad with a zero on the right
              (left, middle, right) = (tape[i-1], tape[i], zero)
          else:
              # no padding required as we are in the interior of the tape
              (left, middle, right) = (tape[i-1], tape[i], tape[i+1])
          newSymbol = updateRule[ (left, middle, right) ]
          updatedTape.append(newSymbol)
      return ''.join(updatedTape)

  def testRule110():
      stringLength = 64
      iterations = 40
      startString = [zero for x in range(stringLength)]
      oneLocations = [stringLength-25, stringLength-1]
      # put a single one at each specified location
      for location in oneLocations:
          startString[location] = one

      tape = startString
      for i in range(iterations):
          print(tape)
          tape = rule110(tape)

      expectedTape = 'GGGGGG----G-GGG-GGGG---GGG---G-GGG--GG---G--GG-GGGGGG-----GG---G'
      assert tape == expectedTape
#+END_SRC

#+BEGIN_SRC python :results output :noweb eval
  <<rule-110>>
  testRule110()
#+END_SRC

#+RESULTS:
#+begin_example
['-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', 'G', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', '-', 'G']
--------------------------------------GG----------------------GG
-------------------------------------GGG---------------------GGG
------------------------------------GG-G--------------------GG-G
-----------------------------------GGGGG-------------------GGGGG
----------------------------------GG---G------------------GG---G
---------------------------------GGG--GG-----------------GGG--GG
--------------------------------GG-G-GGG----------------GG-G-GGG
-------------------------------GGGGGGG-G---------------GGGGGGG-G
------------------------------GG-----GGG--------------GG-----GGG
-----------------------------GGG----GG-G-------------GGG----GG-G
----------------------------GG-G---GGGGG------------GG-G---GGGGG
---------------------------GGGGG--GG---G-----------GGGGG--GG---G
--------------------------GG---G-GGG--GG----------GG---G-GGG--GG
-------------------------GGG--GGGG-G-GGG---------GGG--GGGG-G-GGG
------------------------GG-G-GG--GGGGG-G--------GG-G-GG--GGGGG-G
-----------------------GGGGGGGG-GG---GGG-------GGGGGGGG-GG---GGG
----------------------GG------GGGG--GG-G------GG------GGGG--GG-G
---------------------GGG-----GG--G-GGGGG-----GGG-----GG--G-GGGGG
--------------------GG-G----GGG-GGGG---G----GG-G----GGG-GGGG---G
-------------------GGGGG---GG-GGG--G--GG---GGGGG---GG-GGG--G--GG
------------------GG---G--GGGGG-G-GG-GGG--GG---G--GGGGG-G-GG-GGG
-----------------GGG--GG-GG---GGGGGGGG-G-GGG--GG-GG---GGGGGGGG-G
----------------GG-G-GGGGGG--GG------GGGGG-G-GGGGGG--GG------GGG
---------------GGGGGGG----G-GGG-----GG---GGGGG----G-GGG-----GG-G
--------------GG-----G---GGGG-G----GGG--GG---G---GGGG-G----GGGGG
-------------GGG----GG--GG--GGG---GG-G-GGG--GG--GG--GGG---GG---G
------------GG-G---GGG-GGG-GG-G--GGGGGGG-G-GGG-GGG-GG-G--GGG--GG
-----------GGGGG--GG-GGG-GGGGGG-GG-----GGGGG-GGG-GGGGGG-GG-G-GGG
----------GG---G-GGGGG-GGG----GGGG----GG---GGG-GGG----GGGGGGGG-G
---------GGG--GGGG---GGG-G---GG--G---GGG--GG-GGG-G---GG------GGG
--------GG-G-GG--G--GG-GGG--GGG-GG--GG-G-GGGGG-GGG--GGG-----GG-G
-------GGGGGGGG-GG-GGGGG-G-GG-GGGG-GGGGGGG---GGG-G-GG-G----GGGGG
------GG------GGGGGG---GGGGGGGG--GGG-----G--GG-GGGGGGGG---GG---G
-----GGG-----GG----G--GG------G-GG-G----GG-GGGGG------G--GGG--GG
----GG-G----GGG---GG-GGG-----GGGGGGG---GGGGG---G-----GG-GG-G-GGG
---GGGGG---GG-G--GGGGG-G----GG-----G--GG---G--GG----GGGGGGGGGG-G
--GG---G--GGGGG-GG---GGG---GGG----GG-GGG--GG-GGG---GG--------GGG
-GGG--GG-GG---GGGG--GG-G--GG-G---GGGGG-G-GGGGG-G--GGG-------GG-G
GG-G-GGGGGG--GG--G-GGGGG-GGGGG--GG---GGGGG---GGG-GG-G------GGGGG
#+end_example

